MPS/src/Catalogs/ТочкиСценарияОжидание/ТочкиСценарияОжидание.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТочкиСценарияОжидание</name>
  <owners>Catalog.Сценарии</owners>
  <attributes>
    <name>ВидТочкиОжидания</name>
    <type>
      <types>EnumRef.ВидыТочкиОжидания</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПериодовДействия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодДействия</name>
    <type>
      <types>EnumRef.ПериодыДействий</types>
    </type>
  </attributes>
  <attributes>
    <name>ГраницаСрабатыванияДинамически</name>
    <type>
      <types>EnumRef.ПередСразуПослеДатой</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолеКлиентаДляДинамического</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОграничитьПоВремени</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеОграничиватьВремяСрабатывания</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяПо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧасовойПояс</name>
    <type>
      <types>CatalogRef.ЧасовыеПояса</types>
    </type>
  </attributes>
  <attributes>
    <name>ДниНедели</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

MPS/src/Enums/ВидыТочкиОжидания/ВидыТочкиОжидания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыТочкиОжидания</name>
  <enumValues>
    <name>Фиксированное</name>
  </enumValues>
  <enumValues>
    <name>Динамическое</name>
  </enumValues>
  <enumValues>
    <name>Интервал</name>
  </enumValues>
</mdclass:Enum>

MPS/src/Enums/ПередСразуПосле/ПередСразуПосле.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПередСразуПосле</name>
  <enumValues>
    <name>Перед</name>
  </enumValues>
  <enumValues>
    <name>Сразу</name>
  </enumValues>
  <enumValues>
    <name>После</name>
  </enumValues>
</mdclass:Enum>

MPS/src/Catalogs/ТочкиСценарияОжидание/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	КомпоновкаИРасписание_ПКМП.ОбъектОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Ошибки = Неопределено;
	
	Если ВидТочкиОжидания = Перечисления.ВидыТочкиОжидания.Фиксированное Тогда
		Если КоличествоПериодовДействия = 0 Тогда
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Объект.КоличествоПериодовДействия" , "Не заполнено время ожидания");
		КонецЕсли;	
		Если не ЗначениеЗаполнено(ПериодДействия) Тогда
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Объект.ПериодДействия" , "Не заполнен период ожидания");
		КонецЕсли;	
	ИначеЕсли ВидТочкиОжидания = Перечисления.ВидыТочкиОжидания.Динамическое Тогда
		Если не ЗначениеЗаполнено(ПолеКлиентаДляДинамического) Тогда
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Объект.ПолеКлиентаДляДинамического" , "Не заполнено поле даты клиента");
		КонецЕсли;	
		Если не ЗначениеЗаполнено(ГраницаСрабатыванияДинамически) Тогда
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Объект.ГраницаСрабатыванияДинамически" , "Не заполнен вариант срабатывания");
		ИначеЕсли 	не ГраницаСрабатыванияДинамически = Перечисления.ПередСразуПосле.Сразу Тогда
			Если КоличествоПериодовДействия = 0 Тогда
				ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Объект.КоличествоПериодовДействия" , "Не заполнено время срабатывания");
			КонецЕсли;	
			Если не ЗначениеЗаполнено(ПериодДействия) Тогда
				ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Объект.ПериодДействия" , "Не заполнен период срабатывания");
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;	

	Если ВидТочкиОжидания = Перечисления.ВидыТочкиОжидания.Интервал или ОграничитьПоВремени Тогда
		Если не ЗначениеЗаполнено(ДниНедели) Тогда
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Объект.ОграничитьПоВремени" , "Не заполнены дни недели");
		КонецЕсли;	
	КонецЕсли;	

	
	ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки,  Отказ);
		
КонецПроцедуры

#КонецЕсли
